# İNDEXLEME & SEÇME & FİLTRELEME

# Series Veri Tipi İçin Dilimleme

In [14]:
import pandas as pd
import numpy as np

Series veri tipinde bir obje oluşturalım.

In [15]:
obje=pd.Series(np.arange(5),index=["a","b","c","d","e"])

In [16]:
obje

a    0
b    1
c    2
d    3
e    4
dtype: int32

İstenilen değerleri görebilmek için index değerlerinden yardım alabiliriz.

In [17]:
obje["c"]

2

In [18]:
obje[2]

2

Veriyi dilimlemek istersek

In [19]:
obje[0:3]

a    0
b    1
c    2
dtype: int32

Belirli satırları almak istersek

In [20]:
obje[["a","c"]]

a    0
c    2
dtype: int32

In [21]:
obje[[0,2]]

a    0
c    2
dtype: int32

İkiden küçük değerleri ekrana yazdırmak için

In [22]:
obje[obje<2]

a    0
b    1
dtype: int32

Etiket dilimlemesi normal Python dilimlemesinden farklıdır. Etiket dilimlemesinde son nokta dilimlemeye dahildir.

In [12]:
obje["a":"d"]

a    0
b    1
c    2
d    3
dtype: int32

Dilimlenen kısıma değer ataması yapabiliriz.

In [13]:
obje["a":"d"]=0
obje

a    0
b    0
c    0
d    0
e    4
dtype: int32

# DataFrame İçin Veri Dilimleme

In [24]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=["Bursa","Ankara","Rize","İstanbul"],
                 columns=["bir","iki","üç","dört"])

In [25]:
data

          bir  iki  üç  dört
Bursa       0    1   2     3
Ankara      4    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [26]:
data["iki"]

Bursa        1
Ankara       5
Rize         9
İstanbul    13
Name: iki, dtype: int32

In [27]:
data[["bir","iki"]]

          bir  iki
Bursa       0    1
Ankara      4    5
Rize        8    9
İstanbul   12   13

In [28]:
data[:3]

        bir  iki  üç  dört
Bursa     0    1   2     3
Ankara    4    5   6     7
Rize      8    9  10    11

In [32]:
data[data["dört"]>5]

          bir  iki  üç  dört
Ankara      4    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [33]:
data[data<5]=0

In [34]:
data

          bir  iki  üç  dört
Bursa       0    0   0     0
Ankara      0    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

Satırlarla ilgili işlemler için loc ve iloc operatörleri kullanılabilir.İloc girilen indexin satır değerlerini döndürür.

In [36]:
data.iloc[1]

bir     0
iki     5
üç      6
dört    7
Name: Ankara, dtype: int32

Belli bir satırın belli değerlerini almak hatta belli satırların belli değerlerini de almak mümkündür.

In [38]:
data.iloc[1,[1,2,3]]

iki     5
üç      6
dört    7
Name: Ankara, dtype: int32

In [39]:
data.iloc[[1,3],[1,2,3]]

          iki  üç  dört
Ankara      5   6     7
İstanbul   13  14    15

loc işlemleri için etiket adları kullanılır.

In [40]:
data.loc["Rize",["bir","iki"]]

bir    8
iki    9
Name: Rize, dtype: int32

In [41]:
data.loc[:"Rize","dört"]

Bursa      0
Ankara     7
Rize      11
Name: dört, dtype: int32